# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [6,10, 11,6, 6,7]  # P3/8
  - [11,24, 25,12, 15,14]  # P4/16
  - [46,20, 26,52, 30,40]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
#  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
  [[-1, 1, Conv, [64, 5, 2, 2]],  # 0-P1/2 update   320
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4            160
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/4            160
   [-1, 3, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P3/8            80
   [-1, 6, C3, [512]],
#   [-1, 1, Conv, [1024, 3, 2]],  # 7-P4/16           40
#   [-1, 9, C3, [1024]],
   [-1, 1, SPPF, [512, 5]],  # 9
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [256, 1, 1]],
#   [-1,1,nn.ConvTranspose2d,[512, 2, 2]],# kernel = 2,stride = 2,pad = 0,output_pad = 1(output_pad不支持)
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],    #40*40
   [[-1, 4], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [256, False]],  # 13

   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
#   [-1,1,nn.ConvTranspose2d,[256, 2, 2]],# kernel = 2,stride = 2,pad = 0,output_pad = 1(output_pad不支持)
   [[-1, 2], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [128, False]],  # 17 (P3/8-small)

   [-1, 1, Conv, [128, 3, 2]],
   [[-1, 12], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [256, False]],  # 20 (P4/16-medium)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 8], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [512, False]],  # 23 (P5/32-large)

   [[15, 18, 21], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
